neon12345/ESP32_deskflow/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_0=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# CPU frequency: 360MHz for pre-V3 (400MHz is V3-only, causes esp_clk_init crash)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# Ethernet (ESP32-P4 RMII configuration)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_ADDR=1
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_RMII_CLK_GPIO=50
CONFIG_ETH_RMII_TX_EN_GPIO=49
CONFIG_ETH_RMII_TXD0_GPIO=34
CONFIG_ETH_RMII_TXD1_GPIO=35
CONFIG_ETH_RMII_CRS_DV_GPIO=28
CONFIG_ETH_RMII_RXD0_GPIO=29
CONFIG_ETH_RMII_RXD1_GPIO=30
CONFIG_ETH_MDC_GPIO=31
CONFIG_ETH_MDIO_GPIO=52
CONFIG_ETH_PHY_RST_GPIO=51

# TLS / mbedTLS (TLS 1.3 client)
CONFIG_MBEDTLS_TLS_CLIENT=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# Console UART (default: UART0 on GPIO 37 TX / 38 RX)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Log level - show all messages
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# TinyUSB HID Device
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_COUNT=0

# HTTP Server WebSocket support (required for /api/uart/ws)
CONFIG_HTTPD_WS_SUPPORT=y
# USB Host MSC configuration
CONFIG_USB_HOST=y
CONFIG_USB_HOST_MAX_NUM_EVENT_WORKERS=1
CONFIG_USB_HOST_HUBS_SUPPORTED=y

# FATFS for USB mass storage
CONFIG_FATFS_VOLUME_COUNT=2
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
#CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
